# AllGridRotation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..AllGridRotation Property
DividedSurface Class See Also
---
Angle of rotation applied to the U- and V- directions together.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double AllGridRotation { get; set; }
```

Visual Basic
---
```text
Public Property AllGridRotation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AllGridRotation {
	double get ();
	void set (double value);
}
```

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace